src/test/resources/mockdata/invoices/invoices.json

{
  "invoices": [
    {
      "id": "c0d08448-347b-418a-8c2f-5fb50248d67e",
      "approvalDate": "2018-07-29T00:00:00.000+0000",
      "adjustments": [
       {
      	  "description": "Extra Taxes",
      	  "type": "Amount",
      	  "value": 10.0,
          "prorate": "Not prorated",
          "relationToTotal": "In addition to"
       }
  	  ],
  	  "adjustmentsTotal":10,
      "currency": "USD",
      "folioInvoiceNo": "123invoicenumber45",
      "invoiceDate": "2018-07-20T00:00:00.000+0000",
      "note": "Some note 1",
      "paymentTerms": "Payment in Advance",
      "paymentMethod": "EFT",
      "status": "Approved",
      "source": "024b6f41-c5c6-4280-858e-33fba452a334",
      "subTotal": 5.0,
      "total": 15.0,
      "vendorInvoiceNo": "YK75851",
      "voucherNumber": "478",
      "paymentId": "a5065f0d-fb88-4d23-b0c1-57e754fba40e",
      "poNumbers": [
        "AB268758XYZ"
      ],
      "vendorId": "168f8a63-d612-406e-813f-c7527f241ac3",
      "manualPayment": true
    },
    {
      "id": "9917d4a6-fbb2-4ed6-946d-6cf8c42369e4",
      "approvalDate": "2018-07-29T00:00:00.000+0000",
      "currency": "USD",
      "folioInvoiceNo": "123invoicenumber456",
      "invoiceDate": "2018-08-21T00:00:00.000+0000",
      "note": "Some note 2",
      "paymentTerms": "Payment in Advance",
      "paymentMethod": "EFT",
      "status": "Open",
      "source": "024b6f41-c5c6-4280-858e-33fba452a334",
      "total": 15.0,
      "vendorInvoiceNo": "YK75852",
      "voucherNumber": "479",
      "paymentId": "a5065f0d-fb88-4d23-b0c1-57e754fba40e",
      "poNumbers": [
        "AB268758PQR"
      ],
      "vendorId": "168f8a63-d612-406e-813f-c7527f241ac3",
      "manualPayment": false
    },
    {
      "id": "e6ac6e5b-2dde-4904-bc2d-def3a0b17052",
      "approvalDate": "2018-07-29T00:00:00.000+0000",
      "currency": "USD",
      "folioInvoiceNo": "123invoicenumber47",
      "invoiceDate": "2018-09-21T00:00:00.000+0000",
      "note": "Some note 3",
      "paymentTerms": "Payment in Advance",
      "paymentMethod": "EFT",
      "status": "Open",
      "source": "024b6f41-c5c6-4280-858e-33fba452a334",
      "total": 18.0,
      "vendorInvoiceNo": "YK75853",
      "voucherNumber": "480",
      "paymentId": "a5065f0d-fb88-4d23-b0c1-57e754fba40e",
      "poNumbers": [
        "AB268758LMN"
      ],
      "vendorId": "168f8a63-d612-406e-813f-c7527f241ac3",
      "manualPayment": true
    }
  ],
  "totalRecords": 3
}
